
Router(config)#hostname R1  
R1(config)#interface gig0/0/0  
R1(config-if)#no shutdown  
R1(config-if)#ip address 192.168.1.100 255.255.255.0  
R1(config-if)#interface gig0/0/1  
R1(config-if)#no shutdown  
R1(config-if)#interface gig0/0/1.10  
R1(config-subif)#encapsulation dot1Q 10  
R1(config-subif)#ip address 10.10.10.100 255.255.255.0  
R1(config-subif)#interface gig0/0/1.20  
R1(config-subif)#encapsulation dot1Q 20  
R1(config-subif)#ip address 10.20.20.100 255.255.255.0  
R1(config-subif)#interface f0/0/1.30  
R1(config-subif)#encapsulation dot1Q 30  
R1(config-subif)#ip address 10.30.30.100 255.255.255.0  
R1(config-subif)#interface gig0/0/1.40  
R1(config-subif)#encapsulation dot1Q 40  
R1(config-subif)#ip address 10.40.40.100 255.255.255.0  
R1(config-subif)#ex

! DHCP setup
R1(config)#ip dhcp pool V10  
R1(dhcp-config)#network 10.10.10.0 255.255.255.0  
R1(dhcp-config)#default-router 10.10.10.100  
R1(dhcp-config)#ip dhcp pool V20  
R1(dhcp-config)#network 10.20.20.0 255.255.255.0  
R1(dhcp-config)#default-router 10.20.20.100  
R1(dhcp-config)#ip dhcp pool V30  
R1(dhcp-config)#network 10.30.30.0 255.255.255.0  
R1(dhcp-config)#default-router 10.30.30.100  
R1(dhcp-config)#ip dhcp pool V40  
R1(dhcp-config)#network 10.40.40.0 255.255.255.0  
R1(dhcp-config)#default-router 10.40.40.100

! routing
R1(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.200
R1#ping 60.60.60.1

! PC7 ACL deny server 1 HTTP
! look out for the assigned DHCP IP on PC7 before configuration
R1(config)#access-list 110 deny tcp host 10.40.40.2 host 60.60.60.1 eq 80 log
R1(config)#access-list 110 permit ip any any  
R1(config)#interface gig0/0/1.40 
R1(config-subif)#ip access-group 110 in

! PC6 ACL deny server1 Ping
R1(config)#access-list 112 deny icmp host 10.40.40.2 host 60.60.60.1 echo  
R1(config)#access-list 112 permit ip any any  
R1(config)#interface gig0/0/1.40  
R1(config)#ip access-group 112 in
R1#ping 10.40.40.2

! SSH
R1(config)#ip domain-name scal.com  
R1(config)#crypto key generate rsa modulus 1024
R1(config)#line vty 0 2  
R1(config-line)#login local  
R1(config-line)#transport input ssh  
R1(config-line)#exit  
R1(config)#username admin secret admin  
R1(config)#enable secret cisco


